Tekla Open API Reference for Tekla Structures 2025
Assembly.GetSubAssemblies Method
 Selects and returns a list of subassemblies belonging to the assembly.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ArrayList GetSubAssemblies()
Public Function GetSubAssemblies As ArrayList
Return Value
Type: ArrayList
A list of subassemblies.
See Also
Reference
Assembly Class
Tekla.Structures.Model Namespace